In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings("ignore")

In [4]:
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.compose import ColumnTransformer

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/campusx-official/100-days-of-machine-learning/main/day36-imputing-numerical-data/titanic_toy.csv")
df.sample(5)

      Age     Fare  Family  Survived
879  56.0  83.1583       1         1
811  39.0  24.1500       0         0
433  17.0   7.1250       0         0
718   NaN  15.5000       0         0
321  27.0   7.8958       0         0

In [5]:
df.shape

(891, 4)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       714 non-null    float64
 1   Fare      846 non-null    float64
 2   Family    891 non-null    int64
 3   Survived  891 non-null    int64
dtypes: float64(2), int64(2)
memory usage: 28.0 KB

In [7]:
df.isnull().sum()

Age         177
Fare         45
Family        0
Survived      0
dtype: int64

In [8]:
df.isnull().mean()*100

Age         19.865320
Fare         5.050505
Family       0.000000
Survived     0.000000
dtype: float64

In [9]:
x = df.drop(columns=['Survived'])
y = df['Survived']

In [10]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=2)

In [11]:
x_train.shape,x_test.shape

((712, 3), (179, 3))

In [12]:
x_train.isnull().mean()*100

Age       20.786517
Fare       5.056180
Family     0.000000
dtype: float64

In [13]:
mean_age = x_train['Age'].mean()
median_age = x_train['Age'].median()

mean_fare = x_train['Fare'].mean()
median_fare = x_train['Fare'].median()

In [14]:
x_train['Age_mean'] = x_train['Age'].fillna(mean_age)
x_train['Age_median'] = x_train['Age'].fillna(median_age)

x_train['Fare_mean'] = x_train['Fare'].fillna(mean_fare)
x_train['Fare_median'] = x_train['Fare'].fillna(median_fare)

In [19]:
x_train.sample(15)

      Age     Fare  Family   Age_mean  Age_median  Fare_mean  Fare_median
491  21.0   7.2500       0  21.000000       21.00   7.250000       7.2500
270   NaN  31.0000       0  29.785904       28.75  31.000000      31.0000
686  14.0  39.6875       5  14.000000       14.00  39.687500      39.6875
670  40.0  39.0000       2  40.000000       40.00  39.000000      39.0000
229   NaN      NaN       4  29.785904       28.75  32.617597      14.4583
859   NaN   7.2292       0  29.785904       28.75   7.229200       7.2292
671  31.0  52.0000       1  31.000000       31.00  52.000000      52.0000
619  26.0  10.5000       0  26.000000       26.00  10.500000      10.5000
194  44.0      NaN       0  44.000000       44.00  32.617597      14.4583
585  18.0  79.6500       2  18.000000       18.00  79.650000      79.6500
734  23.0  13.0000       0  23.000000       23.00  13.000000      13.0000
329  16.0  57.9792       1  16.000000       16.00  57.979200      57.9792
345  24.0  13.0000       0  24.000000       24.00  13.000000      13.0000
75   25.0   7.6500       0  25.000000       25.00   7.650000       7.6500
381   1.0  15.7417       2   1.000000        1.00  15.741700      15.7417